[Killed] BlockStatement
src/shared/mime-types.js:35:40
  * @param {string} name - Filename or name with extension
  * @returns {string} MIME type or empty string if unknown
  */
-export function inferContentType(name) {
-  const lower = String(name || '').toLowerCase();
-  const ext = lower.includes('.') ? lower.split('.').pop() : lower;
-  return MIME_MAP[ext] || '';
-}
+export function inferContentType(name) {}
 
 export { MIME_MAP };
killedBy: inferContentTypeFromFilename infers from filename
statusReason: expected undefined to be 'text/plain' // Object.is equality

[Killed] MethodExpression
src/shared/mime-types.js:36:17
  * @returns {string} MIME type or empty string if unknown
  */
 export function inferContentType(name) {
-  const lower = String(name || '').toLowerCase();
+  const lower = String(name || '').toUpperCase();
   const ext = lower.includes('.') ? lower.split('.').pop() : lower;
   return MIME_MAP[ext] || '';
killedBy: inferContentTypeFromFilename infers from filename
statusReason: expected '' to be 'text/plain' // Object.is equality

[Killed] LogicalOperator
src/shared/mime-types.js:36:24
  * @returns {string} MIME type or empty string if unknown
  */
 export function inferContentType(name) {
-  const lower = String(name || '').toLowerCase();
+  const lower = String(name && '').toLowerCase();
   const ext = lower.includes('.') ? lower.split('.').pop() : lower;
   return MIME_MAP[ext] || '';
killedBy: inferContentTypeFromFilename infers from filename
statusReason: expected '' to be 'text/plain' // Object.is equality

[Killed] ConditionalExpression
src/shared/mime-types.js:38:10
 export function inferContentType(name) {
   const lower = String(name || '').toLowerCase();
   const ext = lower.includes('.') ? lower.split('.').pop() : lower;
-  return MIME_MAP[ext] || '';
+  return false;
 }
 
killedBy: inferContentTypeFromFilename infers from filename
statusReason: expected false to be 'text/plain' // Object.is equality

[Killed] LogicalOperator
src/shared/mime-types.js:38:10
 export function inferContentType(name) {
   const lower = String(name || '').toLowerCase();
   const ext = lower.includes('.') ? lower.split('.').pop() : lower;
-  return MIME_MAP[ext] || '';
+  return MIME_MAP[ext] && '';
 }
 
killedBy: inferContentTypeFromFilename infers from filename
statusReason: expected '' to be 'text/plain' // Object.is equality
